### Nama : Lauha Kurnia Safira
### NIM : 200601110056
### Kelas : Praktikum Pemograman Komputer 1-F

## PANDAS
Pandas adalah sebuah librari berlisensi BSD dan open source yang menyediakan struktur data dan analisis data yang mudah digunakan dan berkinerja tinggi untuk bahasa pemograman Python.
- Pandas dapat membaca dan menulis kedalam bentuk CSV, file serta database lain.
- Pandas dapat menghitung statistik dan menjawab pertanyaan seputar statistik(mean,max,median,dkk)
- Pandas dapat menghapus data dengan menghapus nilai yang salah.
- Pandas dapat mengolah data dengan operasi seperti join,distinct,group by,agregasi, dan teknik lainnya yang terdapat pada SQL.

### DataFrame
adalah struktur data dasar pandas.Fitur ini memudahkan untuk membaca sebuah file dan menjadikannya tabel.
Cara paling sederhana membuat dataframe adalah menggunakan struktur data dict dalam python.File yang didukung seperti .txt, .csv, .tsv dan lainnya.

### Install dan Import
#### Install :
- conda install pandas
- pip install pandas
#### Import:
- import pandas
- bisa menyingkat penulisan saat diakses, misalnya "pd"
- import pandas as pd

### Komponen utama pandas
- series : suatu kolom
- Dataframe : kumpulan series, dapat berypa tabel multidimensi

### Fungsi lain
- df.head() : pengambilan 5 data pertama.
- df.head(10) : pengambilan 10 data pertama.
- df.tail(8) : pengambilan 8 data terakhur.
- df.columns : menampilkan nama kolom.
- df[['nama','alamat']] : pilih kolom tertentu.
- Mengacu kedata sebelumnya :
* purchases["oranges"]min() : data terkecil.
* purchases["oranges"]max() : data terbesar.
* purchases["oranges"]mean() : rata-rata.
* purchases["oranges"]sum() : jumlah.
* purchases["oranges"]count() : cacah.
* purchases[purchases["oranges"]==3] : filter data.

## Mengimport pandas

In [1]:
import pandas as pd

### Import .txt
siapkan dahulu file txt (dengan jarak antar data misal menggunakan tab) di folder yang sama dengan program

In [2]:
data1=pd.read_csv("data.txt")
print(data1)

   A\tB
0  1\t2
1  4\t3
2  4\t2

In [3]:
data2=pd.read_csv("data.txt", delimiter="\t")
print(data2)

   A  B
0  1  2
1  4  3
2  4  2

### Import .csv
siapkan dahulu file csv di folder yang sama dengan program

In [4]:
data3=pd.read_csv("data.txt")
print(data3)

   A\tB
0  1\t2
1  4\t3
2  4\t2

In [5]:
data4=pd.read_csv("data.txt", delimiter="\s+")
print(data4)

   A  B
0  1  2
1  4  3
2  4  2

### Import. xlsx
siapkan dahulu file xlsx di folder yang sama dengan program

In [6]:
data5=pd.read_excel('data.xlsx')
print(data5)

   A  B
0  1  2
1  4  3
2  4  2

### Melihat tabel

In [7]:
#semua
data2

   A  B
0  1  2
1  4  3
2  4  2

In [8]:
#sebagian yang diatas (karena datanya sedikit maka yang tampil semua, silahkan coba dengan data yang lebih banyak lagi sendiri)
data2.head()

   A  B
0  1  2
1  4  3
2  4  2

### Membuat Dataframe sendiri

In [9]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [10]:
data = [1,2,3,4,5]
df1 = pd.DataFrame(data)
print(df1)

   0
0  1
1  2
2  3
3  4
4  5

In [11]:
data = [['Purwanto',32],['Purnomo',43],['Purwo',55]]
df2 = pd.DataFrame(data,columns=['Nama','Usia'])
print(df2)

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

Apa saja yang dapat dilakukan dataframe.Tapi sebelumnya kita import pandas dahulu sebagai pd dan numpy sebagai np

In [12]:
import pandas as pd
import numpy as np

### Memanggil data tertentu pada dataframe
Misal kita punya dataframe sebagai berikut:

In [13]:
data = [['Purwanto',32],['Purnomo',43],['Purwo',55]]
df2 = pd.DataFrame(data,columns=['Nama','Usia'])
print(df2)

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

Dan ingin memanggil kolom tertentu

In [14]:
df2["Nama"]

0    Purwanto
1     Purnomo
2       Purwo
Name: Nama, dtype: object

In [15]:
df2["Usia"]

0    32
1    43
2    55
Name: Usia, dtype: int64

In [16]:
df2["Nama"][0]

'Purwanto'

In [17]:
df2.iloc[0][0]

'Purwanto'

In [18]:
df2.loc[0]["Nama"]

'Purwanto'

In [19]:
df2.at[0,"Nama"]

'Purwanto'

In [20]:
df2.iat[0,0]

'Purwanto'

In [21]:
df2.iloc[0]

Nama    Purwanto
Usia          32
Name: 0, dtype: object

In [22]:
df2.loc[:,'Nama']

0    Purwanto
1     Purnomo
2       Purwo
Name: Nama, dtype: object

### Set index

In [23]:
df3 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df3

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [24]:
df3.set_index("Nama")

          Usia
Nama
Purwanto    32
Purnomo     43
Purwo       55

### Pemanggil baris

In [25]:
df4 = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), index= [2, 'A', 4], columns=[48, 49, 50])
df4

   48  49  50
2   1   2   3
A   4   5   6
4   7   8   9

In [26]:
df4.loc[2]

48    1
49    2
50    3
Name: 2, dtype: int32

In [27]:
df4.iloc[2]

48    7
49    8
50    9
Name: 4, dtype: int32

### Menambah kolom

In [28]:
#Menambahkan index di kolom baru
df5 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df5["Index"]=df5.index
df5

       Nama  Usia  Index
0  Purwanto    32      0
1   Purnomo    43      1
2     Purwo    55      2

In [29]:
#Menambahkan kolom dengan isian baru
df5.loc[:, "Gender"] = pd.Series(['L','L','L'])
df5

       Nama  Usia  Index Gender
0  Purwanto    32      0      L
1   Purnomo    43      1      L
2     Purwo    55      2      L

### Melihat ukuran dataframe

In [30]:
#ukuran baris paling panjang
len(df2)

3

In [31]:
#ukuran baris pada kolom tertentu
len(df2["Nama"])

3

In [32]:
#ukuran baris, ukuran kolom dataframe
print(df2.shape)

(3, 2)

### Menghapus

In [33]:
df6 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df6

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [34]:
#menghapus kolom
del df6['Nama']
df6

   Usia
0    32
1    43
2    55

In [35]:
#Menghapus n baris di awal
df6=df6[2:]
df6

   Usia
2    55

In [36]:
df6 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df6

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [37]:
#Menghapus baris tertentu
df6=df6.drop(df6.index[[0,2]])
df6

      Nama  Usia
1  Purnomo    43

### Ekspor dataframe

In [38]:
#import pandas dan numpy
import pandas as pd
import numpy as np
#Misal kita punya suatu dataframe
data = [[1,32],[2,43],[4,55]]
df = pd.DataFrame(data,columns=['Nama','Usia'])
#Convert ke numpy array
databaru = df.to_numpy()
print(databaru)
#Convert ke txt
df.to_csv("dataexport.txt")
#Convert ke csv
df.to_csv("dataexport.csv")
#Convert ke xlsx
writer = pd.ExcelWriter('dataexport.xlsx')
df.to_excel(writer, 'DataFrame')
writer.save()

[[ 1 32]
 [ 2 43]
 [ 4 55]]